## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_vpc_security_group_egress_rule.ecs_egress_all`                                     |
|        | `aws_vpc_security_group_ingress_rule.ecs_ingress_lb`                                    |
| delete | `aws_security_group_rule.ecs_egress_all`                                                |
|        | `aws_security_group_rule.ecs_ingress_lb`                                                |
| update | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_security_group_rule.ecs_egress_all will be destroyed
  # (because aws_security_group_rule.ecs_egress_all is not in configuration)
  - resource "aws_security_group_rule" "ecs_egress_all" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow ECS security group to send all traffic" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-3679506382" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-085c606383f33733e" -> null
      - security_group_rule_id = "sgr-06640ad94beb78fdc" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # aws_security_group_rule.ecs_ingress_lb will be destroyed
  # (because aws_security_group_rule.ecs_ingress_lb is not in configuration)
  - resource "aws_security_group_rule" "ecs_ingress_lb" {
      - description              = "Allow the ecs security group to receive traffic only from the load balancer on port 3001" -> null
      - from_port                = 3001 -> null
      - id                       = "sgrule-2118413993" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-085c606383f33733e" -> null
      - security_group_rule_id   = "sgr-037780b4d3144d124" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-08e35f1019824d56a" -> null
      - to_port                  = 3001 -> null
      - type                     = "ingress" -> null
    }

  # aws_vpc_security_group_egress_rule.ecs_egress_all will be created
  + resource "aws_vpc_security_group_egress_rule" "ecs_egress_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow ECS security group to send all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = "sg-085c606383f33733e"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_vpc_security_group_ingress_rule.ecs_ingress_lb will be created
  + resource "aws_vpc_security_group_ingress_rule" "ecs_ingress_lb" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + from_port              = 3001
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-085c606383f33733e"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + to_port                = 3001
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "ai-answers-cluster"
      ~ last_modified                  = "2025-04-02T20:32:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "HBr+yq+1I0J3FirYAqWtzdc18ZJdwgcRm6tSHU6l2TQ=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "ai-answers-staging"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_security_group_egress_rule.ecs_egress_all"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_security_group_ingress_rule.ecs_ingress_lb"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]
FAIL - plan.json - main - Security group has invalid ports for protocol: ["aws_security_group.ecs_tasks", "aws_security_group.ecs_tasks", "aws_security_group.ecs_tasks"]

28 tests, 18 passed, 9 warnings, 1 failure, 0 exceptions

```

</details>
